from matplotlib import pyplot as plt
import numpy as np

CB91_Blue = '#2CBDFE'
CB91_Purple = '#9D2EC5'
CB91_Green = '#47DBCD'
CB91_Pink = '#F3A0F2'
CB91_Violet = '#ddff00'
CB91_Amber = '#F5B14C'

color_list = [CB91_Blue, CB91_Pink, CB91_Green, CB91_Amber,
              CB91_Purple, CB91_Violet]
plt.rcParams['axes.prop_cycle'] = plt.cycler(color=color_list)

# Контекстное кодирование
y = [0.8784652835869684, 0.8791581738954632]
x = [33.84, 33.89]
plt.plot(x, y, label='Контекстное кодирование', color=color_list[2])

# Лес
# y = np.array([35.05325729, 34.55172386, 34.08088541, 33.58116081, 32.52727909 ,31.837055,
#  30.49544195 ,29.8898305 , 29.72475258])
# y -= 0.15
# x = [0.685302734375, 0.619415283203125, 0.567108154296875, 0.526580810546875, 0.44244384765625,
#      0.392120361328125, 0.309814453125, 0.276458740234375, 0.2674560546875]
# plt.plot(x, y,  label='Случа-йный лес глубины 4', color=color_list[3])

# Пни
# y = np.array([35.37244928 ,34.9169995 , 34.31383977, 33.8008013  ,32.71122055 ,31.99670376,
#  29.80043651])
# x = [0.685302734375, 0.619415283203125, 0.567108154296875, 0.526580810546875,
#      0.44244384765625, 0.392120361328125, 0.276458740234375]
# y -= 0.3
# plt.plot(x, y, label='Случайный лес глубины 1', color=color_list[4])

# регрессия
# y = np.array([29.93001554 ,31.14927424 ,31.62341617, 33.24771295, 35.01306626])
# y += 0.07
# x = [0.350128173828125, 0.39703369140625, 0.431549072265625, 0.546539306640625, 0.72369384765625]
# plt.plot(x, y, label='Регрессия 2-го порядка', color=color_list[5])

plt.title('Barbara')
plt.grid(visible=True)
plt.legend()
plt.xlabel('bpp, бит')
plt.ylabel('PSNR, дБ')
plt.show()
